create_clock -name clk -period 10.0 [get_ports clk_i]
set_input_delay -clock clk 2.00 [get_ports {boot_addr_i branch_target_ex_i csr_depc_i csr_mepc_i csr_mtvec_i dummy_instr_en_i dummy_instr_mask_i dummy_instr_seed_en_i dummy_instr_seed_i exc_cause exc_pc_mux_i ic_data_rdata_i ic_scr_key_valid_i ic_tag_rdata_i icache_enable_i icache_inval_i id_in_ready_i instr_bus_err_i instr_gnt_i instr_rdata_i instr_rvalid_i instr_valid_clear_i nt_branch_addr_i nt_branch_mispredict_i pc_mux_i pc_set_i pmp_err_if_i pmp_err_if_plus2_i req_i rst_ni}]
set_output_delay -clock clk 2.00 [get_ports {csr_mtvec_init_o dummy_instr_id_o ic_data_addr_o ic_data_req_o ic_data_wdata_o ic_data_write_o ic_scr_key_req_o ic_tag_addr_o ic_tag_req_o ic_tag_wdata_o ic_tag_write_o icache_ecc_error_o if_busy_o illegal_c_insn_id_o instr_addr_o instr_bp_taken_o instr_expanded_id_o instr_fetch_err_o instr_fetch_err_plus2_o instr_gets_expanded_id_o instr_intg_err_o instr_is_compressed_id_o instr_new_id_o instr_rdata_alu_id_o instr_rdata_c_id_o instr_rdata_id_o instr_req_o instr_valid_id_o pc_id_o pc_if_o pc_mismatch_alert_o}]
set_false_path -from [get_ports rst_ni]
