create_clock -name clk -period 10.0 [get_ports clk_i]
set_input_delay -clock clk 2.00 [get_ports {branch_decision_i csr_mstatus_mie_i csr_mstatus_tw_i csr_rdata_i data_ind_timing_i debug_ebreakm_i debug_ebreaku_i debug_req_i debug_single_step_i ex_valid_i illegal_c_insn_i illegal_csr_insn_i imd_val_d_ex_i imd_val_we_ex_i instr_bp_taken_i instr_exec_i instr_fetch_err_i instr_fetch_err_plus2_i instr_is_compressed_i instr_rdata_alu_i instr_rdata_c_i instr_rdata_i instr_valid_i irq_nm_i irq_pending_i irqs_i lsu_addr_incr_req_i lsu_addr_last_i lsu_load_err_i lsu_load_resp_intg_err_i lsu_req_done_i lsu_resp_valid_i lsu_store_err_i lsu_store_resp_intg_err_i outstanding_load_wb_i outstanding_store_wb_i pc_id_i priv_mode_i ready_wb_i result_ex_i rf_rdata_a_i rf_rdata_b_i rf_waddr_wb_i rf_wdata_fwd_wb_i rf_write_wb_i rst_ni trigger_match_i}]
set_output_delay -clock clk 2.00 [get_ports {alu_operand_a_ex_o alu_operand_b_ex_o alu_operator_ex_o bt_a_operand_o bt_b_operand_o csr_access_o csr_addr_o csr_mtval_o csr_op_en_o csr_op_o csr_restore_dret_id_o csr_restore_mret_id_o csr_save_cause_o csr_save_id_o csr_save_if_o csr_save_wb_o ctrl_busy_o debug_cause_o debug_csr_save_o debug_mode_entering_o debug_mode_o div_en_ex_o div_sel_ex_o en_wb_o exc_cause_o exc_pc_mux_o expecting_load_resp_o expecting_store_resp_o icache_inval_o id_in_ready_o illegal_insn_o imd_val_q_ex_o instr_first_cycle_id_o instr_id_done_o instr_perf_count_id_o instr_req_o instr_type_wb_o instr_valid_clear_o lsu_req_o lsu_sign_ext_o lsu_type_o lsu_wdata_o lsu_we_o mult_en_ex_o mult_sel_ex_o multdiv_operand_a_ex_o multdiv_operand_b_ex_o multdiv_operator_ex_o multdiv_ready_id_o multdiv_signed_mode_ex_o nmi_mode_o nt_branch_addr_o nt_branch_mispredict_o pc_mux_o pc_set_o perf_branch_o perf_div_wait_o perf_dside_wait_o perf_jump_o perf_mul_wait_o perf_tbranch_o rf_raddr_a_o rf_raddr_b_o rf_rd_a_wb_match_o rf_rd_b_wb_match_o rf_ren_a_o rf_ren_b_o rf_waddr_id_o rf_wdata_id_o rf_we_id_o}]
set_false_path -from [get_ports rst_ni]
